<!DOCTYPE html>
<html>
<!-- based on a Pen by Devilish Alchemist @ http://codepen.io/devilishalchemist/pen/LERvpM -->
<head>
  <meta charset="UTF-8">
  <title>2.2 цикл while</title>

  <link rel="stylesheet" href="./resources/css/normalize.min.css">
  <link rel="stylesheet" href="./resources/css/whhg.css">
  <link rel="stylesheet" href="./resources/css/fonts.css">
  <link rel="stylesheet" href="./resources/css/style.css">

</head>

<body>
  <div class="page">

    <span id="view-toc" class="tooltip">&laquo; view index</span>
    <span id="view-content" class="tooltip">return to content &raquo;</span>
    <span id="view-next" class="tooltip">next page &raquo;</span>
    <span id="view-prev" class="tooltip">&laquo; previous page</span>

    <span class="menu_toggle">
      <i class="menu_open icon icon-th-list"></i>
      <i class="menu_close icon icon-import"></i>
    </span>

    <div id="navigation">
      <ul>
<li><a href="../../Git.html" title="Git" class="page">Git</a></li>
<li><a href="../../Python.html" title="Python" class="page">Python</a>
<ul>
<li><a href="../python_http.server.html" title="python http.server" class="page">python http.server</a></li>
<li><a href="../python_для_unl.html" title="python для unl" class="page">python для unl</a></li>
<li><a href="../курс_stepik_мои_решения.html" title="курс stepik мои решения" class="page">курс stepik мои решения</a>
<ul>
<li><a href="./1.10_условия_if_elif_else.html" title="1.10 условия if elif else" class="page">1.10 условия if elif else</a></li>
<li><b>2.2 цикл while</b></li>
<li><a href="./2.3_цикл_for_range.html" title="2.3 цикл for range" class="page">2.3 цикл for range</a></li>
<li><a href="./2.4_строки_и_символы.html" title="2.4 строки и символы" class="page">2.4 строки и символы</a></li>
<li><a href="./2.5_списки.html" title="2.5 списки" class="page">2.5 списки</a></li>
<li><a href="./3.1_функции.html" title="3.1 функции" class="page">3.1 функции</a></li>
<li><a href="./3.2_словари.html" title="3.2 словари" class="page">3.2 словари</a></li>
<li><a href="./3.4_файловый_ввод_вывод.html" title="3.4 файловый ввод вывод" class="page">3.4 файловый ввод вывод</a></li>
</ul></li>
</ul></li>
<li><a href="../../Ruby_on_Rails.html" title="Ruby on Rails" class="page">Ruby on Rails</a></li>
<li><a href="../../Sphinx.html" title="Sphinx" class="page">Sphinx</a></li>
</ul>

      <span class="zimversion">
        <small>built with</small><br><strong>Zim 0.76.1</strong>
        <br>
        --
        <br>
        <a href="https://github.com/scar45/ResponsivePivot">template<br> on Github<br><i class="icon icon-github"></i></a>
      </span>
    </div>

    <main class="content">
      <div class="content_inner">
        <article>
          <header>
            <a id="navPrev" href='./1.10_условия_if_elif_else.html'><span><i class="icon icon-chevron-left"></i></span></a>

            <a id="navHome" href='../../Home.html'><span><i class="icon icon-homealt"></i></span></a>

            <a id="navNext" href='./2.3_цикл_for_range.html'><span><i class="icon icon-chevron-right"></i></span></a>
          </header>

          <section>
            <div class="page-title">
              <h1><i class="icon icon-bookmarkalt"></i> 2.2 цикл while <a name='Python:курс stepik мои решения:2.2 цикл while'></a></h1>
            </div>
            <div class="fade fade-top"></div>
            <div class="page-body">
              <p>
Created пятница 26 Март 2021
</p>
<br>
<p>
Напишите программу, которая считывает со стандартного ввода целые числа, по одному числу в строке, и после первого введенного нуля выводит сумму полученных на вход чисел.
</p>
<div class="zim-object">
<pre><code class="python">s = 0
a = 1
while a != 0:
    a = int(input())
    s = s + a 
print(s)  
</code></pre>
</div>
<br>
<br>
<p>
Программа должна считывать размеры команд (два положительных целых числа a  и  b, каждое число вводится на отдельной строке) и выводить наименьшее число d, которое делится на оба этих числа без остатка.
</p>
<div class="zim-object">
<pre><code class="python">a, b = int(input()), int(input())
i = 1
d = 1
while (d % a != 0 or d % b != 0):
    d = (a * i / b)
    i += 1
print(int(d)) 
</code></pre>
</div>
<br>
<p>
не моё:
</p>
<div class="zim-object">
<pre><code class="python">a = int(input())
b = int(input())
d = a
while d % b:
    d += a
print(d)
</code></pre>
</div>
<br>
<br>
<p>
Напишите программу, которая считывает целые числа с консоли по одному числу в строке.<br>
Для каждого введённого числа проверить:<br>
если число меньше 10, то пропускаем это число;<br>
если число больше 100, то прекращаем считывать числа;<br>
в остальных случаях вывести это число обратно на консоль в отдельной строке.
</p>
<div class="zim-object">
<pre><code class="python">n = 0
while n &lt;= 100:
    n = int(input())
    if n &lt; 10: 
        continue
    if n &gt; 100:
        break
    print(n)
</code></pre>
</div>
<br>
<br>
<p>
Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.<br>
Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно.<br>
В примере мы считываем числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов, не обращая внимания на то, что остались ещё не прочитанные значения.﻿
</p>
<div class="zim-object">
<pre><code class="python">sum_sqr, digit = 0, 0
sum_digit = 0.3 #костыль
while sum_digit != 0:
    digit = int(input())
    sum_sqr = sum_sqr + digit ** 2
    sum_digit = int(sum_digit) + digit
print(sum_sqr)
</code></pre>
</div>
<br>
<br>
<div class="zim-object">
<pre><code class="python">
</code></pre>
</div>
<br>
<br>
<br>
<br>
<br>

            </div>
            <div class="fade fade-bottom"></div>
          </section>

          <footer>
              <a href="#" class="scrollToTop" title="Back to top"><i class="icon icon-uploadalt"></i></a>
          </footer>
        </article>
      </div>
    </main>
  </div>

  <script src="./resources/js/jquery.v2.1.3.min.js"></script>
  <script src="./resources/js/index.js"></script>

</body>
</html>
