<!DOCTYPE html>
<html>
<!-- based on a Pen by Devilish Alchemist @ http://codepen.io/devilishalchemist/pen/LERvpM -->
<head>
  <meta charset="UTF-8">
  <title>2.3 цикл for range</title>

  <link rel="stylesheet" href="./resources/css/normalize.min.css">
  <link rel="stylesheet" href="./resources/css/whhg.css">
  <link rel="stylesheet" href="./resources/css/fonts.css">
  <link rel="stylesheet" href="./resources/css/style.css">

</head>

<body>
  <div class="page">

    <span id="view-toc" class="tooltip">&laquo; view index</span>
    <span id="view-content" class="tooltip">return to content &raquo;</span>
    <span id="view-next" class="tooltip">next page &raquo;</span>
    <span id="view-prev" class="tooltip">&laquo; previous page</span>

    <span class="menu_toggle">
      <i class="menu_open icon icon-th-list"></i>
      <i class="menu_close icon icon-import"></i>
    </span>

    <div id="navigation">
      <ul>
<li><a href="../../Git.html" title="Git" class="page">Git</a></li>
<li><a href="../../Python.html" title="Python" class="page">Python</a>
<ul>
<li><a href="../python_http.server.html" title="python http.server" class="page">python http.server</a></li>
<li><a href="../python_для_unl.html" title="python для unl" class="page">python для unl</a></li>
<li><a href="../курс_stepik_мои_решения.html" title="курс stepik мои решения" class="page">курс stepik мои решения</a>
<ul>
<li><a href="./1.10_условия_if_elif_else.html" title="1.10 условия if elif else" class="page">1.10 условия if elif else</a></li>
<li><a href="./2.2_цикл_while.html" title="2.2 цикл while" class="page">2.2 цикл while</a></li>
<li><b>2.3 цикл for range</b></li>
<li><a href="./2.4_строки_и_символы.html" title="2.4 строки и символы" class="page">2.4 строки и символы</a></li>
<li><a href="./2.5_списки.html" title="2.5 списки" class="page">2.5 списки</a></li>
<li><a href="./3.1_функции.html" title="3.1 функции" class="page">3.1 функции</a></li>
<li><a href="./3.2_словари.html" title="3.2 словари" class="page">3.2 словари</a></li>
<li><a href="./3.4_файловый_ввод_вывод.html" title="3.4 файловый ввод вывод" class="page">3.4 файловый ввод вывод</a></li>
</ul></li>
</ul></li>
<li><a href="../../Ruby_on_Rails.html" title="Ruby on Rails" class="page">Ruby on Rails</a></li>
<li><a href="../../Sphinx.html" title="Sphinx" class="page">Sphinx</a></li>
</ul>

      <span class="zimversion">
        <small>built with</small><br><strong>Zim 0.76.1</strong>
        <br>
        --
        <br>
        <a href="https://github.com/scar45/ResponsivePivot">template<br> on Github<br><i class="icon icon-github"></i></a>
      </span>
    </div>

    <main class="content">
      <div class="content_inner">
        <article>
          <header>
            <a id="navPrev" href='./2.2_цикл_while.html'><span><i class="icon icon-chevron-left"></i></span></a>

            <a id="navHome" href='../../Home.html'><span><i class="icon icon-homealt"></i></span></a>

            <a id="navNext" href='./2.4_строки_и_символы.html'><span><i class="icon icon-chevron-right"></i></span></a>
          </header>

          <section>
            <div class="page-title">
              <h1><i class="icon icon-bookmarkalt"></i> 2.3 цикл for range <a name='Python:курс stepik мои решения:2.3 цикл for range'></a></h1>
            </div>
            <div class="fade fade-top"></div>
            <div class="page-body">
              <p>
Created Воскресенье 28 марта 2021
</p>
<br>
<br>
<p>
Напишите программу, на вход которой даются четыре числа a a a, b b b, c c c и d d d, каждое в своей строке. Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка [a;b] [a; b] [a;b] на все числа отрезка [c;d] [c;d] [c;d].<br>
Числа a a a, b b b, c c c и d d d являются натуральными и не превосходят 10, a≤b a \le b a≤b, c≤d c \le d c≤d.<br>
Следуйте формату вывода из примера, для разделения элементов внутри строки используйте '\t' — символ табуляции. Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных отрезков — заголовочные столбец и строка таблицы.﻿
</p>
<br>
<div class="zim-object">
<pre><code class="python">a, b, c, d = (int(input()) for i in range(4)) 
for j in range(c, d + 1):
    print(f"\t{j}", end = '')
for i in range(a, b + 1):
    print(f"\t\n{i}", end = '')
    for j in range(c, d + 1):
        print(f"\t{i * j}", end = '')
</code></pre>
</div>
<br>
<p>
Напишите программу, которая считывает с клавиатуры два числа a и b, считает и выводит на консоль среднее арифметическое всех чисел из отрезка [a;b], которые кратны числу 3.
</p>
<div class="zim-object">
<pre><code class="python">#a, b = (int(i) for i in input().split()) ввод переменных из 1 строки
a, b = (int(input()) for i in range(2)) #ввод переменных из разных строк
s = n = 0
for j in range(a, b + 1):
    if j % 3 == 0:
        n += 1
        s += j
sa = s / n
print(sa)

</code></pre>
</div>

            </div>
            <div class="fade fade-bottom"></div>
          </section>

          <footer>
              <a href="#" class="scrollToTop" title="Back to top"><i class="icon icon-uploadalt"></i></a>
          </footer>
        </article>
      </div>
    </main>
  </div>

  <script src="./resources/js/jquery.v2.1.3.min.js"></script>
  <script src="./resources/js/index.js"></script>

</body>
</html>
